Курс_Бухгалтерские_задачи/src/Documents/ИзменениеСвойствОсновныхСредств/ИзменениеСвойствОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСвойствОсновныхСредств</name>
  <registerRecords>InformationRegister.СвойстваОсновныхСредств</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияОсновногоСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МатериальноОтвественноеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Курс_Бухгалтерские_задачи/src/InformationRegisters/СвойстваОсновныхСредств/СвойстваОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваОсновныхСредств</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОсновногоСредства</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МатериальноОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Курс_Бухгалтерские_задачи/src/Documents/ИзменениеСвойствОсновныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СвойстваОсновныхСредств
	Движения.СвойстваОсновныхСредств.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеСредства Из ОсновныеСредства Цикл
		Движение = Движения.СвойстваОсновныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ОсновноеСредство = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		Движение.Состояние = ТекСтрокаОсновныеСредства.Состояние;
		Движение.СрокПолезногоИспользования = ТекСтрокаОсновныеСредства.СрокПолезногоИспользования;
		Движение.МатериальноОтветственноеЛицо = ТекСтрокаОсновныеСредства.МатериальноОтвественноеЛицо;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
